#!/usr/bin/python3

virama = '\u0d4d'
anuswara = '\u0d02'

vowels = {
    '\u0d05' : 'aa', # അ
    '\u0d06' : 'ab', # ആ
    '\u0d07' : 'ac', # ഇ
    '\u0d08' : 'ad', # ഈ
    '\u0d09' : 'ae', # ഉ
    '\u0d0a' : 'af', # ഊ
    '\u0d0b' : 'ag', # ഋ
    '\u0d60' : 'ah', # ൠ
    '\u0d0c' : 'ai', # ഌ
    '\u0d61' : 'aj', # ൡ
    '\u0d0e' : 'ak', # എ
    '\u0d0f' : 'al', # ഏ
    '\u0d10' : 'am', # ഐ
    '\u0d12' : 'an', # ഒ
    '\u0d13' : 'ao', # ഓ
    '\u0d14' : 'ap', # ഔ
}

a_sign = 'ba'

vowel_signs = {
    '\u0d3e' : 'bb', # aa
    '\u0d3f' : 'bc', # i
    '\u0d40' : 'bd', # ii
    '\u0d41' : 'be', # u
    '\u0d42' : 'bf', # uu
    '\u0d43' : 'bg', # R
    '\u0d44' : 'bh', # RR
    '\u0d62' : 'bi', # L
    '\u0d63' : 'bj', # LL
    '\u0d46' : 'bk', # e
    '\u0d47' : 'bl', # E
    '\u0d48' : 'bm', # ai
    '\u0d4a' : 'bn', # o
    '\u0d4b' : 'bo', # O
    '\u0d4c' : 'bp', # au
    '\u0d57' : 'bq', # au with one sign
}

ka_consonants = {
    '\u0d15' : 'ca', # ക
    '\u0d16' : 'cb', # ഖ
    '\u0d17' : 'cc', # ഗ
    '\u0d18' : 'cd', # ഘ
    '\u0d19' : 'ce', # ങ
}

cha_consonants = {
    '\u0d1a' : 'cf', # ച
    '\u0d1b' : 'cg', # ഛ
    '\u0d1c' : 'ch', # ജ
    '\u0d1d' : 'ci', # ഝ
    '\u0d1e' : 'cj', # ഞ
}

ta_consonants = {
    '\u0d1f' : 'ck', # ട
    '\u0d20' : 'cl', # ഠ
    '\u0d21' : 'cm', # ഡ
    '\u0d22' : 'cn', # ഢ
    '\u0d23' : 'co', # ണ
}

tha_consonants = {
    '\u0d24' : 'cp', # ത
    '\u0d25' : 'cq', # ഥ
    '\u0d26' : 'cr', # ദ
    '\u0d27' : 'cs', # ധ
    '\u0d28' : 'ct', # ന
    '\u0d29' : 'cu', # ഩ
}

pa_consonants = {
    '\u0d2a' : 'cv', # പ
    '\u0d2b' : 'cw', # ഫ
    '\u0d2c' : 'cx', # ബ
    '\u0d2d' : 'cy', # ഭ
    '\u0d2e' : 'cz', # മ
}

ya_consonants = {
    '\u0d2f' : 'da', # യ
    '\u0d30' : 'db', # ര
    '\u0d32' : 'dc', # ല
    '\u0d35' : 'dd', # വ
    '\u0d36' : 'de', # ശ
    '\u0d37' : 'df', # ഷ
    '\u0d38' : 'dg', # സ
    '\u0d39' : 'dh', # ഹ
    '\u0d03' : 'di', # ഃ
    '\u0d33' : 'dj', # ള
    '\u0d34' : 'dk', # ഴ
    '\u0d31' : 'dl', # റ
}

consonants = {**ka_consonants, **cha_consonants, **ta_consonants, **tha_consonants, **pa_consonants, **ya_consonants}

reverse_char_map = {
    "\u0d7c" : "\u0d30\u0d4d\u200d",
    "\u0d7d" : "\u0d32\u0d4d\u200d" ,
    "\u0d7b" : "\u0d28\u0d4d\u200d",
    "\u0d7a" : "\u0d23\u0d4d\u200d",
    "\u0d7e" : "\u0d33\u0d4d\u200d",
    "\u0d57" : "\u0d4c",
}

class IndexKeyGenerator:

    def generate(self, s):

        for f, t in reverse_char_map.items():
          s = s.replace(f, t)

        # Add 'zzz' so that it will sort after English words.
        g = 'zzz'

        s_length = len(s)
        idx = 0
        while idx < s_length:
            code = s[idx]

            if code in vowels:
                # ആ, ആ, ..., ഔ.  Output the corresponding code.
                g += vowels[code]
                idx += 1

            elif code in consonants:
                g += consonants[code]

                # Check the next code point.
                if idx < s_length-1:
                    n = s[idx+1]

                    if n in vowel_signs:
                        # Next is one of vowel signs:  aa, u, ii, ..., au
                        g += vowel_signs[n]
                        idx += 2 # Skip the next letter as well.

                    elif n == virama:
                        # Ignore virama.
                        idx += 2

                    else:
                        # A consonant without virama and vowel sign.
                        # Treat it as "a" vowel sign.
                        # There is no code point for that, but we need to generate a mapping string for that
                        # for sorting purposes.
                        g += a_sign
                        idx += 1

                else:
                    # Last letter is a consonant.  Treat it as a constant with 'a' sign.
                    g += a_sign
                    idx += 1

            elif code == anuswara:
                # Anuswara is mapped to an anunaasikam based on the next letter.
                if idx < s_length - 1:
                    n = s[idx+1]

                    if n in ka_consonants:
                        # If the next letter is ക, ഖ, ഗ, ഘ or ങ, the current letter becomesd ങ.
                        g += ka_consonants['\u0d19']

                    elif n in cha_consonants:
                        # If the next letter is ച, ഛ, ജ, ഝ or ഞ, the current letter becomesd ഞ.
                        g += cha_consonants['\u0d1e']

                    elif n in ta_consonants:
                        # If the next letter is ട, ഠ, ഡ, ഢ or ണ, the current letter becomesd ണ.
                        g += ta_consonants['\u0d23']

                    elif n in tha_consonants:
                        # If the next letter is ത, ഥ, ദ, ധ, ന or ഩ, the current letter becomesd ന.
                        g += tha_consonants['\u0d28']

                    else:
                        # For all other letters, the current letter is മ.
                        g += pa_consonants['\u0d2e']

                else:
                    # Anuswaram at the end is treated as മ. 
                    g += pa_consonants['\u0d2e']

                idx += 1

            else:
                # Ignore any other letter, like spaces, punctuations etc.
                idx += 1
        return g



if __name__ == '__main__':

    words = [
        'അംഗാരാക്ഷായ സാക്ഷാലിനിയ',
        'അംബാ കുപ്യതി താത',
        'അകണ്ഠേ കളങ്കാദനംഗേ',
        'അക്കാലം സഖി, മാഞ്ഞുപോയൊരു',
        'അഖണ്ഡവിധുമണ്ഡലമുഖം',
        'അങ്കണേ ഘടിതരിംഘണം',
        'അടങ്ങണമൊതുങ്ങണം',
        'അടങ്ങാതന്തിയ്ക്കങ്ങ്',
        'അടിയനിനിയുമുണ്ടാം',
        'അണ്ണാക്കില്‍ തങ്ങി',
        'അത്യുഗ്രാടോപമോടും',
        'അനാദ്യന്തമാദ്യം',
        'അന്തര്യശ്ച ബഹിര്‍',
        'അന്തര്‍ഭാഗത്തു ചേര്‍ത്ത',
        'അന്തിപ്പന്തലിലമ്പിളിയ്ക്കു ഭുവനം',
        'അന്നഗാമിനി, നതാംഗി',
        'അപ്പീലിക്കണ്ണു ചൂടും',
        'അപ്യന്നസ്മിന്‍ ജലധര',
        'അപ്രജാപതി ഭവത്പദാബ്ജ',
        'അമ്പത്തൊന്നക്ഷരാളീ',
        'അമ്പാടിക്കൊരു ഭൂഷണം',
        'അമ്മാമന്‍ തന്റെ നെഞ്ഞത്ത്',
        'അയി ജനമാനസമാനസ',
        'അയ്യോ, നല്ലൊരരങ്ങണഞ്ഞു',
        'അരിയ്ക്കകത്തു വല്ലതും വരയ്ക്കലല്ല',
        'അല്ലേ സ്നേഹിതരേ',
        'അല്ലോളം തവ മന്ദഹാസനികടേ',
        'അശ്വത്ഥത്തിന്നിലയ്ക്കും',
        'ആ ദിക്കില്‍ കാത്തു നില്‍പ്പൂ ജലധര',
        'ആ മണ്‍മെത്തകളാറ്റുനോറ്റ',
        'ആ മന്ദാരമരങ്ങളാണു',
        'ആകമ്രം മദ്ധ്യമുദ്യന്മണി',
        'ആചാരപ്പടി പാര്‍ത്തു കാണ്‍കില്‍',
        'ആടീ മൃണ്മയവേദിയില്‍',
        'ആദ്യം വന്നതു കാലബോധം',
        'ആനക്കമ്പനൊരുത്ത, നാനനടയാള്‍',
        'ആനന്ദം പകരുന്നതുണ്ടൊരുവന്',
        'ആനീലശ്ലക്ഷ്മകേശം',
        'ആരംഗം സര്‍വമാച്ഛാദിതമഹഹ',
        'ആരക്ഷീണതപസ്യയാല്‍',
        'ആരണ്യാന്തരഗഹ്വരോദര',
        'ആരാധിപ്പാ, നരുണപദ',
        'ആരോ ചെയ്തൊരു പുണ്യ',
        'ആറ്റിലെത്തിയെതിരേ',
        'ആസ്താം താവദിയം',
        'ഇന്ദുശ്രീമുഖമിന്ദ്രനീല',
        'ഇന്ദ്രം ദ്വ്യക്ഷ, മമന്ദപൂര്‍വ്വമുദധിം',
        'ഇന്നാകുന്നു ശകുന്തളാ',
        'ഇന്നാളോളം നിനക്കായ്',
        'ഇപ്പാഴ്പ്പാതപ്പരപ്പില്‍‌',
        'ഇളകാത്ത ഹൃത്തൊടിള',
        'ഇവനിതാ വനിതാ',
        'ഈ ലോകത്തില്‍ സുഖമസുഖവും',
        'ഈടേറും മേടതോറും',
        'ഈയെന്‍ ജീവിതവീഥി',
        'ഉടുത്തുള്ള പട്ടൊന്നു',
        'ഉണ്ടോ നേരത്തുടുക്കും',
        'ഉണ്ണിത്തൃക്കാലിണയ്ക്കും',
        'ഉമ്മ വെച്ചിടണമെങ്കില്‍',
        'ഊണിന്നാസ്ഥ കുറഞ്ഞു',
        'ഊണെന്നും പണമെന്നുമേണമിഴിമാര്‍',
        'എടുത്തിട്ടൂക്കേറും കരമിരുപതാല്‍',
        'എനിക്കില്ലാ പദ്യാവലിയെഴുതുവാന്‍',
        'എന്നാണെത്തിയ, തെത്രനാളവധി',
        'എന്നായാലും മരിക്കും, വിധിയുടെ',
        'എന്നാലും താതനല്ലേ?',
        'എന്നിട്ടെല്ലാവരും പോ, യറയിലിരുവരായ്‌',
        'എന്നെപ്പോലുമെനിക്കു നേര്‍വഴി',
        'എല്ലാമീശ്വരനിശ്ചയം, പനി വരാ',
        'എല്ലായ്പോഴും കളിപ്പാന്‍ ചുടല',
        'ഏകത്ര കൊങ്കകള്‍, പരത്ര',
        'ഏറിക്കൊള്ളായിരുന്നൂ പുരഹര',
        'ഒക്കത്തേറ്റിയൊരമ്മ',
        'ഒന്റിന്മേലൂന്റിനാലത്തൊഴിലൊരുവനു',
        'ഒപ്പം നിന്ന സഹോദരര്‍ക്കശനി',
        'ഒറ്റയ്ക്കല്ല ജനിപ്പതും മരണവും',
        'ഒറ്റയ്ക്കാണു ജനിപ്പതും മരണവും',
        'ഒറ്റയ്ക്കേ ജനി മര്‍ത്ത്യ',
        'ഓങ്കാരാബ്ജമരന്ദമേ',
        'ഓണക്കോടി ഞൊറിഞ്ഞുടുത്തു',
        'ഓമല്‍ച്ചെഞ്ചൊടി മുന്തിരിങ്ങ',
        'ഓരോ ജീവകണത്തിനുള്ളിലും',
        'ഓരോ ജീവകണത്തിലും സുദൃഢമായ്',
        'ഓരോ വര്‍ഷവുമെത്തവേ പുതിയതാം',
        'ഓലക്കാല്‍ പോലെ വെച്ചേന്‍',
        'കട്ടിന്മേല്‍ മൃദുമെത്തയിട്ടതിനു',
        'കണ്ടാലെന്താണു, കാലത്ത്',
        'കണ്ടിട്ടുള്ള ദിനം മറന്നു',
        'കണ്ടോരുണ്ടോ? കഴുത്തില്‍',
        'കണ്ടോരുണ്ടോ? തപശ്ശാന്തത',
        'കണ്ടോരുണ്ടോ? തുറുങ്കില്‍',
        'കണ്ടോരുണ്ടോ? വ്രജത്തിന്‍',
        'കണ്ണാ കണ്ണാകണം നീ',
        'കതിരവനെ വിഴുങ്ങും',
        'കരാളഫാലപട്ടികാ',
        'കഴിഞ്ഞേ പോകുന്നൂ',
        'കശ്ചിത് കാന്താ വിരഹഗുരുണാ',
        'കഷ്ടം, സ്ഥാനവലിപ്പമോ',
        'കാടത്തത്തെ മനസ്സിലിട്ടു',
        'കാടത്തത്തൊടെതിര്‍ത്തു',
        'കാടല്ലേ നിന്റെ ഭര്‍ത്താവിനു',
        'കാണാനെന്തൊരു മോഹം',
        'കാതില്‍ക്കത്തുന്ന കാന്തി',
        'കാന്തന്മാരൊത്തു',
        'കാരുണ്യക്കടലേ',
        'കാരോലപ്പവുമട',
        'കാറോടിക്കും വപുസ്സും',
        'കാറോടും കാന്തി, കാര്‍ശ്യം,',
        'കാറ്റില്‍ തീപ്പൊരി പോലെ',
        'കാറ്റുലച്ച ചെറുവഞ്ചി പോലെ',
        'കാറ്റേല്‍ക്കുമ്പോള്‍ തിളങ്ങും',
        'കാലം മാറിക്കഴിഞ്ഞൂ,',
        'കാലം വന്നാല്‍ മരിയ്ക്കും',
        'കാലന്‍ കാളായസാത്യുത്ക്കട',
        'കാലാരാതി കനിഞ്ഞിടുന്നതു വരെ',
        'കാലേതാനും മടക്കി',
        'കാളമേഘമിട തിങ്ങി',
        'കാളാംഭോദകമായ കമ്രരുചിയാല്‍',
        'കാളാംഭോധരപാളി താളി',
        'കാളിന്ദിപ്പുഴവക്കിലുണ്ട്',
        'കിടത്തി ജടയില്‍പ്പിടിച്ചൊരുവളെ',
        'കിര്‍ത്തിക്കേണ്ടുന്ന ഭക്തപ്രവരരെ',
        'കിഴവനെ യുവാവാക്കും',
        'കീടഃ കശ്ചന വൃശ്ചികഃ,',
        'കീര്‍ത്തിയ്ക്കാം തിരുനാമം',
        'കുട്ടിക്കാലമതെത്ര തുഷ്ടികരം',
        'കുട്ടിക്കുരംഗമിഴിയാമുമ തന്റെ',
        'കുന്തളാവലി വിയര്‍ത്ത',
        'കുന്നിന്‍നാട്ടിലെ ബാന്ധവം',
        'കുന്നിയ്ക്കും കുറയാതെ',
        'കുലാദ്യഖിലസദ്ഗുണ',
        'കുളിര്‍ത്ത മണിമാറു',
        'കൂറും നന്മയുമേറിടും',
        'കൂലാതിഗാമിഭയ',
        'കൃതാന്തബന്ധബന്ധനൈക',
        'കേറാനെന്തേ മടിക്കുന്നതു',
        'കേറുന്നൂ മുകളില്‍ കഥഞ്ചന',
        'കേശപാശധൃതപിഞ്ഛികാ',
        'കൊക്കായ് പാറിപ്പറക്കാം',
        'കൊഞ്ചും മഞ്ജീരമോമല്‍ തരിവള',
        'കൊണ്ടല്‍ച്ചായല്‍ക്കറുപ്പും',
        'കൊണ്ടല്‍വേണിയൊരു രണ്ടുനാലടി',
        'കോടക്കാര്‍വര്‍ണ്ണനോടക്കുഴലൊടു',
        'കോടക്കാറ്റിലഴിഞ്ഞുലഞ്ഞ ചിടയും',
        'കോപം, വാശി, കുശു, മ്പസൂയ,',
        'കോരിക്കൂട്ടിയ പാഴ്ക്കരിക്കിടയിലെ',
        'കോല്‍ത്തേനോലേണമോരോ പദ, മതി',
        'കൌശേയം പിഞ്ഞി, കൌമോദകിയുടെ',
        'ക്രീഡിച്ചും കീരവാണീ',
        'ക്ഷീണാപാണ്ഡുകപോലമാം',
        'ക്ഷീണിക്കാത്ത മനീഷയും',
        'ഗംഗാധരാദൃത, മസംഗാശയാംബുരുഹ',
        'ഗാനത്താലവനീപതേ, മധുരമാം',
        'ഗൂഢം പാതിരയില്‍',
        'ഗോവൃന്ദം മേച്ചു വൃന്ദാവനഭുവി',
        'ഘോരാകാരാട്ടഹാസപ്രകടിതകലഹം',
        'ഘോരാണാം ദാനവാനാം',
        'ഘോരായുധവ്രണിതകാന്ത',
        'ചഞ്ചല്‍ച്ചില്ലീലതയ്ക്കും, പെരിയ',
        'ചന്തം ചിന്തുന്ന ചന്ദ്രോത്സവം',
        'ചന്ദ്രോദ്ഭാസിതശേഖരേ സ്മരഹരേ',
        'ചാടിന്‍ ചട്ടം ചവിട്ടി',
        'ചായപ്പീടികയില്‍ പ്രഭാത',
        'ചാരം, വെള്ളം, കരിത്തോല്‍,',
        'ചിന്നീടും കാന്തി',
        'ചിരിക്കാം ചെന്തീയില്‍',
        'ചുറ്റും കെട്ടിയുയര്‍ത്തിവച്ച',
        'ചുറ്റും മുണ്ടില്ല, ചീ',
        'ചൂടായ്കില്‍ തുളസീദളം',
        'ചൂടില്ലാത്തോരു ഫാലം',
        'ചൂടും പൂവിനു ശണ്ഠകൂടുമിരു',
        'ചെന്നായിന്‍ ഹൃത്തിനും ഹാ',
        'ചേടീഭവന്നിഖിലഖാടീ',
        'ചേരുന്നീലാരുമായെന്‍ ശ്രുതി',
        'ചേലക്കള്ളന്‍ ചിലപ്പോള്‍',
        'ചേലായാല്‍ മതി പെണ്‍കുളിക്കടവിലെ',
        'ചൊടിച്ചുഗ്രമാം കണ്ണു',
        'ഛന്ദസ്സിന്‍ താളമാത്രാ',
        'ഛായാഗ്രാഹകപൃഷ്ഠദര്‍ശനം',
        'ജംഭപ്രദ്വേഷിമുമ്പില്‍',
        'ജടാകടാഹസംഭ്രമ',
        'ജടാടവീഗളജ്ജലപ്രവാഹ',
        'ജന്മാദ് യസ്യ യതോന്വയാത്',
        'ജാതിബ്ഭ്രാന്തരടക്കി വെച്ചൊരമലം',
        'ജാതീ, ജാതാനുകമ്പാ ഭവ',
        'ഞാനീ ഗ്രീഷ്മസരോവരത്തില്‍',
        'ഞാനീ ജാലകവാതിലില്‍',
        'ഞാനെന്നാല്‍ ഞായരക്ഷയ്ക്കൊരു',
        'ഞാനോ മാനിനിമാര്‍ക്കു',
        'ഞെട്ടും താവകനാമമൊന്നു',
        'ടിക്കറ്റിന്നു തപസ്സുചെയ്യണം',
        'ഠാണാവില്‍ജ്ജനനം',
        'തട്ടിന്‍മേലെയിടയ്ക്കു മൂഷികഗണം',
        'തണ്ടാര്‍മാതാം രമയ്ക്കോ',
        'തത്സേവാര്‍ത്ഥം തരുണസഹിതാഃ',
        'തനീയാംസം പാംസും',
        'തന്തയുള്ളതു തണുപ്പനാണു',
        'തന്നില്ലല്ലോ വിധാതാ',
        'തയ്യായ നാളിലലിവാര്‍ന്നൊരു',
        'തല്പത്തിന്നരികത്തണഞ്ഞു',
        'താമരയ്ക്കു ശശിയോടുമില്ലിഹ',
        'തായയ്ക്കും താതനും നിന്‍',
        'തായാരാകട്ടെ, തന്‍',
        'താരാപുഷ്പങ്ങള്‍ ചിന്നി',
        'താരാഹാരമലങ്കരിച്ചു',
        'താരില്‍ത്തന്വീകടാക്ഷാഞ്ചല',
        'താരുണ്യാഭോഗഭാരത്തൊടും',
        'താളം തെറ്റിയ ജീവിത',
        'തിണ്ണം ചെന്നിട്ടു തീയില്‍',
        'തീരാഞ്ഞോ കൊതി, കട്ടവെണ്ണ',
        'തുങ്ഗശ്രീസിംഹവാഹേ',
        'തുമ്പീ തുള്ളുക, തുള്ളിയാര്‍ക്കുക,',
        'തുള്ളിപ്പാറിപ്പറക്കും സുമുഖി',
        'തൂവെണ്ണപ്രിയനാണു',
        'തൂവെള്ളിപ്പര്‍വ്വതത്തിന്‍',
        'തെണ്ടീട്ടാണശനം',
        'തെണ്ടേണം പല ദിക്കില്‍ നാഥനു',
        'തെന്നലാം മണിരഥത്തിലേറി',
        'തേടിത്തേടി നടന്നു കാലടി',
        'തേനഞ്ചീടിന ഗാഥയാലൊരു',
        'തേരോടിക്കെ, ക്കടക്കണ്മുന',
        'തേളു തുച്ഛമൊരു',
        'ത്രാസം നല്‍കിയുണര്‍ന്ന',
        'ത്വിട്ടോലുമക്ഷികള്‍',
        'ദര്‍ഭാങ്കുരേണ ചരണഃ ക്ഷതഃ',
        'ദിക്കാലാതീതസദ്',
        'ദുഷ്ക്കര്‍മ്മം ചെയ്തിരിയ്ക്കാമഹം',
        'ധരാധരേന്ദ്രനന്ദിനീ',
        'ധാതാവെത്ര മനോഹരാംഗനകളെ',
        'ധിക്‌ പാണ്ഡുപുത്രചരിതം',
        'ധ്യാനം നിര്‍ത്തി, വിശാലനീല',
        'നഞ്ഞാളും കാളിയന്‍ തന്‍',
        'നന്ദിയ്ക്കെന്‍ നന്ദി നാഥാ',
        'നന്നിശ്ശബ്ദപ്രഘോഷം വിരുത',
        'നന്നോ മെയ്യണിവാനുമേ',
        'നാദം ശൂന്യതയിങ്കലാദ്യമമൃതം',
        'നാദം, താളം, വെളിച്ചം,',
        'നാദം, സ്പന്ദം, വെളിച്ചം,',
        'നാദബ്രഹ്മമഹാഗ്നിതന്നില്‍',
        'നാലാമ്‌നായൈകമൂലം',
        'നാളീകാക്ഷന്റെ മാറത്തരുളിന',
        'നാവെപ്പോള്‍ മുരളുന്നതും',
        'നിത്യം തെണ്ടുവതെത്ര നീചം',
        'നിത്യം നശ്ചിത്തപദ്മേ',
        'നിത്യം ശ്ലോകസദസ്സില്‍',
        'നിന്‍ നേത്രത്തൊടു നേരെനിക്കു',
        'നിന്‍ ഭവ്യം പെയ്തു നൂറ്റാണ്ടരുളിയ',
        'നില്‍ക്കട്ടേ പേറ്റുനോവിന്‍ കഥ',
        'നീ വന്നെത്തിയതീ യുഗപ്രതിഭതന്‍',
        'നീയാം സ്നേഹപയോധരത്തെ',
        'നീയിന്ത്യയ്ക്കൊരു ശാപമായി',
        'നീരന്ധ്രനീലജലദ',
        'നീരന്ധ്രാളകമിന്ദ്രനീല, മമലം',
        'നീരാടും ജട, നീറണിഞ്ഞ',
        'നീറും തീപ്പൊരി കണ്ണിലും',
        'നീലക്കണ്ണുകളോ, ദിനാന്ത',
        'നീലാകാശത്തിലേറും',
        'നീലാകാശപ്പരപ്പോ തവ തനു',
        'നൂറ്റാണ്ടില്‍പ്പാതിയോളം',
        'നെഞ്ഞത്തിന്നലെ രാത്രി പൂച്ച',
        'നെഞ്ഞില്‍ക്കാണാവു നാം',
        'നെടിയ മല കിഴക്കും',
        'നെന്മേനിവാകമലര്‍മേനി',
        'നേന്ത്രയ്ക്കായ് നാലു കീറി',
        'നേരമ്പോക്കായി മാത്രം',
        'നോക്കിക്കാണുകിലെന്തു',
        'നോവിപ്പിക്കാതെ, ശസ്ത്ര',
        'പച്ചപ്പട്ടും തൊഴും നിന്‍',
        'പണിക്കു വന്നും വിപണിക്കു',
        'പണ്ടങ്കക്കളരിയ്ക്കകത്തു',
        'പത്രം വിസ്തൃതമത്ര',
        'പയ്യെപ്പൈക്കുട്ടി തന്നെ',
        'പറഞ്ഞ കടുവാക്കുകള്‍',
        'പള്ളിക്കൈവില്ലു പൊന്‍കുന്ന്',
        'പാടത്തുംകര നീളെ',
        'പാടാനില്ലൊരു പാടവം',
        'പാടിക്കേട്ടതു പാടുപെട്ടു',
        'പാടിപ്പാടിയനന്തമാധുരി',
        'പാടില്ലാ നീലവണ്ടേ, സ്മരനുടെ',
        'പാതിക്കെട്ടു കൊതിച്ചു ഞാന്‍',
        'പാഥോരാശിപ്രഭാവേ',
        'പാരം പാരാകെ വേണ്ടും',
        'പാരാവാരം കരേറിക്കരകള്‍',
        'പാരില്‍ പ്രാര്‍ത്ഥന',
        'പാലംഭോരാശിമദ്ധ്യേ',
        'പാലാഴിക്കോളിരമ്പത്തിലുമൊരു',
        'പാലാഴിത്തയ്യലാള്‍ തന്‍',
        'പാലാഴിത്തിര, വെണ്മതിപ്രഭ,',
        'പാലാഴിത്തിരമാല നാലുപുറവും',
        'പാളീടാത്ത മനീഷയും',
        'പിച്ചക്കാരന്‍ കുബേരന്‍',
        'പിച്ചക്കാരന്‍ ഗമിച്ചാനെവിടെ',
        'പിച്ചനെല്ലവിലിടിച്ചുകെട്ടിയ',
        'പീതാംബരം കരവിരാജിത',
        'പീലി ചാര്‍ത്തിയൊരു കുന്തളം',
        'പീലിക്കാര്‍കൂന്തല്‍ കെട്ടി',
        'പീലിക്കാര്‍കൂന്തല്‍ കെട്ടീട്ടഴകൊടു',
        'പുഞ്ചപ്പാടവരമ്പിലാടി',
        'പുറ്റിന്‍ മൌനത്തില്‍ വാചാലതയുടെ',
        'പൂണെല്ലുന്തിച്ചടച്ചാടിയ',
        'പൂമാതല്ലേ കളത്രം?',
        'പൂമെത്തേലെഴുനേറ്റിരുന്നു',
        'പൂവിന്‍ ചുണ്ടു തൊടുന്നതില്ല',
        'പെറ്റോരാ മക്കളെല്ലാമപകടം',
        'പേടിച്ചോടേണ്ട നില്പിന്‍',
        'പേരോര്‍ക്കുന്നീല, കൃത്യപ്പിഴ',
        'പേര്‍ കാളും കവിമല്ലരെ',
        'പേറ്റുനോവവിടെ നിന്നിടട്ടെ',
        'പൈന്തിങ്കള്‍ത്തിരു നെറ്റി',
        'പൊട്ടാക്കിപ്ഫാലവട്ടത്തിരുമിഴി',
        'പൊല്‍പ്പൂവാമമ്പെടുത്തോ',
        'പോകുണ്ടുന്നിതു നാള്‍ ശകുന്തള',
        'പോവുന്ന നേരമഴകാര്‍ന്നിടതൂര്‍ന്നു',
        'പ്രാണാധിഭര്‍ത്ത്രി, കരയായ്ക',
        'പ്രാര്‍ത്ഥിച്ചാല്‍ പദമേകുമെങ്കിലുമഹോ',
        'പ്രാലേയാദ്രിസുതേ, തവ സ്‌തനതടം',
        'ഫാലം ചാരു ലലന്തികാവിലസിതം',
        'ഫാലത്തീയിനു വെള്ളമുണ്ടു',
        'ഫാലനേത്രമതിലുള്ള തീപ്പൊരി',
        'ഫാലേ നീലാളകങ്ങള്‍ക്ക്',
        'ഫാലേ വേര്‍പ്പുകള്‍ വറ്റിയില്ല',
        'ഫുല്ലാബ്ജത്തിനു രമ്യതക്കു',
        'ബാണന്‍ തന്‍ കോട്ട കാത്തൂ',
        'ബാലാര്‍ക്കായുതതേജസം ധൃതജടാ',
        'ബാലാര്‍ക്കായുതതേജസം, ത്രിഭുവന',
        'ബ്രഹ്മാവിന്റെയുമന്തകന്റെയുമഹോ',
        'ബ്രഹ്മാവിഷ്ണുര്‍ഗിരീശഃ',
        'ഭംഗ്യാ പിംഗേ ഭുജംഗാവലി',
        'ഭക്തര്‍ക്കിഷ്ടം കൊടുക്കും',
        'ഭക്ത്യാ കൈക്കൊണ്ടു ചിത്തേ',
        'ഭവനമാ വനമാക്കി',
        'ഭിക്ഷാര്‍ത്ഥീ സ ക്വ യാതഃ',
        'ഭിക്ഷോ, മാംസനിഷേവണം',
        'ഭുഞ്ജാനാസ്സാകമേകാം',
        'മങ്കത്തയ്യൊളിമെയ്‌മിനുപ്പെഴുമിളം',
        'മച്ചിത്തത്തിലടിച്ചിടും',
        'മണ്ണിലുണ്ടു കരിവിണ്ണിലുണ്ടു',
        'മണ്ണും പെണ്ണും കൊതിക്കും',
        'മണ്ണുണ്ണും, വെണ്ണയുണ്ണും,',
        'മഥിതദനുജജാലം',
        'മന്നില്‍ക്കോളാര്‍ന്നിരമ്പും ജലനിധി',
        'മയൂഖനഖരത്രുട',
        'മയ്യഞ്ചും തിരുമെയ്യു',
        'മര്‍ത്യാകാരേണ ഗോപീ',
        'മറ്റാരുണ്ടിങ്ങെനിക്കപ്പെരുവനം',
        'മല്ലാരിപ്രിയയായ ഭാമ',
        'മാടിന്‍ പാലൊരു തുള്ളിവിട്ടു',
        'മാതംഗാനന, മംബ്ജവാസരമണീം',
        'മാനം ചേര്‍ന്ന ഭടന്റെ',
        'മാനം, മര്യാദ, മാന്യ',
        'മാന്യന്‍മാര്‍ പലരും',
        'മാരന്‍ പൂമെയ്‌ കരിക്കാം',
        'മിന്നല്‍ക്കൊക്കുന്ന പൂമെയ്പ്പൊലിമ',
        'മീനാങ്കോപമ, കണ്‍കലക്കം',
        'മീനായതും ഭവതി മാനായതും',
        'മുട്ടാതേര്‍പ്പെട്ടു',
        'മുട്ടുകുത്തി, മണിമണ്ഡന',
        'മുണ്ടാക്കക്ഷത്തു ചുറ്റി',
        'മുപ്പാരും കാക്കുവാനില്ലപരന്‍',
        'മുറ്റത്തീണത്തിലോടി',
        'മുറ്റത്തേയ്ക്കെത്തിനോക്കി',
        'മൂടിക്കെട്ടിയ മൌനമല്ല',
        'മൂടില്ലാത്തൊരു മുണ്ടുകൊണ്ടു',
        'മൂടുന്നൂ ഭയവും നിരാശതകളും',
        'മൂഢന്നും പണ്ഡിതന്നും',
        'മൂലം നാള്‍ മുറ്റുമാളും',
        'മെയ്യില്‍പ്പാമ്പുണ്ടനേകം',
        'മേഘം, വണ്ടിണ്ട, ചന്ദ്രക്കല,',
        'മേലേ വെണ്‍ കുട പോല്‍',
        'മേളിച്ചേറെ രസിച്ച',
        'യക്ഷാധീശ്വരപട്ടമോ, മഹിതമാം',
        'യാ കുന്ദേന്ദുതുഷാരഹാരധവളാ',
        'യാഗത്തിന്നു വധിച്ചിടാം പശുവിനെ',
        'യാസ്യത്യദ്യ ശകുന്തളേതി',
        'രക്ഷോനാഥന്‍ കുലുക്കീ',
        'രണ്ടായ്‌ നീങ്ങിയകന്നു',
        'രണ്ടുകയ്യിലുമുരുണ്ട വെണ്ണ',
        'രമാകാന്തം കാന്തം',
        'രാവില്‍ സ്വൈരമനിദ്രയായ്‌',
        'രേ രേ കര്‍ണ്ണ, രണത്തിനായ്‌ വരിക',
        'രേതോരൂപത്തിലച്ഛന്‍',
        'ലക്ഷ്യം കൂടാതെ ലങ്കാ',
        'ലാളിച്ചീടാന്‍ യശോദാ',
        'ലാവണ്യം കൊണ്ടിണങ്ങും പുതുമ',
        'ലാവണ്യക്കടലില്‍ക്കളങ്കം',
        'ലോകം ശാശ്വതമല്ല, ജീവിത',
        'ലോകാനാമേകനാഥം',
        'ലോകാലോകകലാമയീ',
        'വക്കത്തുത്കണ്ഠയാലുത്കടരുജ',
        'വന്ദിക്കുന്നോരെനിക്കെന്തഭിമതം',
        'വന്ധ്യം ശമിക്കരിശം',
        'വന്‍ നര്‍മ്മദാനദിയെയും',
        'വറ്റിപ്പോയൊരു നീര്‍ത്തടത്തിലുഴറും',
        'വാകച്ചാര്‍ത്തിനു വല്ല',
        'വാടാമെന്‍ തനു',
        'വാണീദേവി, സുനീലവേണി',
        'വാനത്തെഗ്ഗംഗയെത്തന്‍ ',
        'വായിക്കാന്‍ കഴിവസ്തമിച്ചു',
        'വാരഞ്ചും താരി, ലോമല്‍ക്കുളിരൊളി',
        'വാരാശി, തന്നൊടുവിലെശ്ശിശു',
        'വാളല്ലെന്‍ സമരായുധം',
        'വാളിന്‍ ശൂരത മൂക്കിലും',
        'വിദ്യാ നാമ നരസ്യ രൂപമധികം',
        'വിദ്വത്പീഠമെനിക്കു വേണ്ട',
        'വിമലമാമലമാനിനി',
        'വില പെരുത്തു കൊടുത്തു',
        'വിശ്വാധീശ്വര, രൂപയായിരമെനിക്കീ',
        'വിശ്വാമിത്ര, വസിഷ്ഠ, ഗൌതമ,',
        'വീടീകരാഗ്രാ വിരഹാതുരാ',
        'വീണക്കമ്പി മുറുക്കിടുന്നു',
        'വീണക്കമ്പികള്‍ മീട്ടി നിന്‍',
        'വീതാശങ്കമഹോ, വിനാശകരമാ',
        'വീഴാന്‍ പോവതു കണ്ടു',
        'വൃത്തോത്തുംഗകുചങ്ങള്‍',
        'വെണ്ണത്തൂമണമാര്‍ന്ന വായ്‌മലരിനാല്‍',
        'വെണ്ണീറും വെള്ളെലിമ്പും',
        'വെണ്ണീറും, വെള്ളെലിമ്പും,',
        'വെയ്ക്കാനന്തിവിളക്കു',
        'വെള്ളം ചേര്‍ക്കാതെടുത്തോരമൃതിനു',
        'വെള്ളം, വെണ്ണീര്‍, വൃഷം,',
        'വേണുനാദകൃതതാന',
        'വേണുവിന്‍ ശ്രുതിയൊടൊത്തു',
        'വേദം നിന്നുടെ ശാസനക്കുറി',
        'വേറേ ജന്മമെനിക്കു വേണ്ട',
        'വൈരാഗ്യമേറിയൊരു',
        'വ്യാളം വിഭൂതിയിവ പൂണ്ട്',
        'ശങ്കാഹീനം ശശാങ്കാമലതരയശസാ',
        'ശര്‍മ്മത്തെസ്സല്‍ക്കരിക്കും',
        'ശസ്ത്രത്തെശ്ശൂരനാമെന്‍',
        'ശീട്ടാട്ടം, ശിങ്കമാനക്കുഴല്‍വിളി',
        'ശൃങ്ഗാരത്തിന്റെ നാമ്പോ',
        'ശോണാകാരം നറും തൃച്ചൊടി',
        'ശൌരേരാദ്യാവതാരം തരളമിഴിയുഗം',
        'ശ്യാമപ്പൂമെത്ത',
        'ശ്യാമാപാംഗ, നിനക്കു',
        'ശ്രീപാര്‍ക്കും സ്ഥാനമല്ലോ',
        'ശ്രീമത്‌ സൂര്യന്നു ശിഷ്യന്‍',
        'ശ്രീയാ, ണുര്‍വ്വശിയാണു',
        'ശ്രീരാജീവാക്ഷവക്ഷസ്ഥല',
        'സംസത്തില്‍ സ്വാവമാനോദ്യത',
        'സംസാരത്തിന്‍ കൊളുത്തെന്‍',
        'സംസാരാമയഘോര',
        'സം‌വര്‍ത്തത്തിലൊരാല്‍',
        'സദാ സുകൃതവാഹയായ്',
        'സദ്വര്‍ണ്ണാഞ്ചിതശയ്യ ചേര്‍ന്ന്',
        'സമ്പത്തായ്‌ സംയമത്തെ',
        'സരസിജമനുവിദ്ധം',
        'സല്‍പ്പാത്രത്തിലൊഴിച്ചതില്ലൊരു',
        'സാന്ദ്രാനന്ദാവബോധാത്മകമനുപമിതം',
        'സാരമുള്ള വചനങ്ങള്‍',
        'സാരാനര്‍ഘപ്രകാശപ്രചുരിമ',
        'സിന്ദൂരാരുണവിഗ്രഹാം',
        'സോമാര്‍ദ്ധത്തിന്നുദിപ്പാന്‍',
        'സൌകര്യപ്പെടുമെങ്കിലേതു',
        'സ്വത്തിന്നാര്‍ത്തി പെരുത്തതാം',
        'സ്വായത്തം മലയാളമാര്‍ന്നിടുമിടം',
        'ഹത്വാ യുദ്ധേ ദശാസ്യം',
        'ഹന്ത, ക്രീഡയിലിക്കരം',
        'ഹാ കഷ്ടം നരജീവിതം',
        'ഹാ ഹാ, ഭൂതലവാസമെത്ര',
        'ഹാ, പുഷ്പമേ, അധിക',
        'ഹിമകണാഞ്ചിത',
        'ഹിമാദ്രിതുംഗശേഖരാം',
        'ഹുങ്കാളുന്ന തിമിങ്ഗിലങ്ങള്‍',
        'ഹൃത്തിന്നൊത്ത വപുസ്സെടുത്തു',
        'ഹ്രീങ്കാരക്ഷീരവാരാന്നിധി',
    ] 

    ikg = IndexKeyGenerator()

    i = 0
    for w in words:
        print(ikg.generate(w), w)
        i += 1
